flow_agent/src/envelope.txt

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:vim25="urn:vim25">
  <soapenv:Header>
  </soapenv:Header>
  <soapenv:Body>
    <vim25:PutUsbScanCodes>
      <_this type="VirtualMachine">{}</_this>
      <spec>
        <keyEvents>
          <usbHidCode>4</usbHidCode> 
        </keyEvents>
        <keyEvents>
          <usbHidCode>5</usbHidCode>
        </keyEvents>
        <keyEvents>
          <usbHidCode>6</usbHidCode>
        </keyEvents>
        <keyEvents>
          <usbHidCode>7</usbHidCode>
        </keyEvents>
        <keyEvents>
          <usbHidCode>8</usbHidCode>
        </keyEvents>
      </spec>
    </vim25:PutUsbScanCodes>
  </soapenv:Body>
</soapenv:Envelope>
